a01notes/summaryimages/generatedsummaries/a20Week7Testingandclosing/a06performancetestingandautomated/jmeterpoc/html_report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 62.114999999999995,
    "medianResTime" : 61.5,
    "minResTime" : 29.0,
    "maxResTime" : 147.0,
    "pct1ResTime" : 82.9,
    "pct2ResTime" : 85.89999999999998,
    "pct3ResTime" : 127.0,
    "throughput" : 41.797283176593524,
    "receivedKBytesPerSec" : 350.3275617163009,
    "sentKBytesPerSec" : 10.298295454545455
  },
  "GET /sc_employees" : {
    "transaction" : "GET /sc_employees",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.70000000000001,
    "medianResTime" : 59.0,
    "minResTime" : 29.0,
    "maxResTime" : 127.0,
    "pct1ResTime" : 74.0,
    "pct2ResTime" : 98.5499999999999,
    "pct3ResTime" : 127.0,
    "throughput" : 21.226915729144554,
    "receivedKBytesPerSec" : 346.5727237449586,
    "sentKBytesPerSec" : 3.7727526002971765
  },
  "POST /sc_employees" : {
    "transaction" : "POST /sc_employees",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 64.53,
    "medianResTime" : 64.5,
    "minResTime" : 38.0,
    "maxResTime" : 147.0,
    "pct1ResTime" : 83.0,
    "pct2ResTime" : 84.0,
    "pct3ResTime" : 146.48999999999972,
    "throughput" : 21.510002151000215,
    "receivedKBytesPerSec" : 9.381217734996774,
    "sentKBytesPerSec" : 6.776490912024091
  }
}